# pd.DataFrame.mask

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(range(5))

In [3]:
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [4]:
s.mask(s > 0)

0    0.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [5]:
s.where(s > 1, 10)

0    10
1    10
2     2
3     3
4     4
dtype: int64

In [7]:
s.where(s > 1, None)

0    None
1    None
2       2
3       3
4       4
dtype: object

In [8]:
s.where(s > 1, 0)

0    0
1    0
2    2
3    3
4    4
dtype: int64

In [ ]:
s.where(s > 1, 0)

In [11]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [16]:
s = pd.Series(range(15))

In [17]:
s.mask(s >= 6, 0)

0     0
1     1
2     2
3     3
4     4
5     5
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
dtype: int64

In [19]:
df = pd.DataFrame({
    'A':['0.11','0.22','0.33'],
    'B':['0.21','0.22','0.23'],
    'C':['0.31','0.32','0.33'],
    'D':['0.41','0.42','0.43'],
    'E':['0.51','0.52','0.53'],
    'F':['0.61','0.62','0.63'],
})
df

      A     B     C     D     E     F
0  0.11  0.21  0.31  0.41  0.51  0.61
1  0.22  0.22  0.32  0.42  0.52  0.62
2  0.33  0.23  0.33  0.43  0.53  0.63

In [22]:
df = pd.DataFrame({
    'A':[0.11,0.22,0.33],
    'B':[0.21,0.22,0.23],
    'C':[0.31,0.32,0.33],
    'D':[0.41,0.42,0.43],
    'E':[0.51,0.52,0.53],
    'F':[0.61,0.62,0.63],
})
df

      A     B     C     D     E     F
0  0.11  0.21  0.31  0.41  0.51  0.61
1  0.22  0.22  0.32  0.42  0.52  0.62
2  0.33  0.23  0.33  0.43  0.53  0.63

In [25]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
F    float64
dtype: object

In [27]:
df.mask('A'>0.3,0)

TypeError: '>' not supported between instances of 'str' and 'float'

In [28]:
df = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [30]:
m = df % 3 == 0
m

       A      B
0   True  False
1  False   True
2  False  False
3   True  False
4  False   True

In [31]:
df.where(m, -df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [32]:
df.where(m, -df) == np.where(m, df, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [33]:
df.where(m, -df) == df.mask(~m, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [34]:
df.mask(~m, -df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9